
学院：
性别: 男，女，中性
年级: 本一到博三
身高：cm
体重：kg
if (有暗恋经历) {
  认识暗恋对象时间： 年 月
  暗恋开始时间: 年 月
  暗恋对象吸引点排序
  朋友的作用偏向于添乱/造机会
  if (有告白) {
    表达方式：情书，送礼物，网上告白
    告白时间点：年月
    事先认为是否能成功
    ...
    if (告白成功) {
      if (亲密关系健在) {
        简单的爱情三角测量
      }
      else {
        分手时间
        分手理由:
        ？
        对方跟自己当初的设想不一样；
        觉得对方只是喜欢那种被自己追求的感觉；
        不是上述原因；
      }
    }
  else if(!亲密关系健在){
    if(爱慕结束) {
        爱慕结束时间：年 月
      }
  }
  目前的关系
}


if (有被暗恋经历) {
  认识暗恋方时间： 年 月
  暗恋发觉时间: 年 月
  朋友的作用
  if (被告白) {
    告白时间点：年月
    对方表达方式：情书，送礼物，网上告白
    if (告白成功) {
      if (亲密关系健在) {
        简单的爱情三角测量
        打分/量表
      }
      else {
        分手时间
        分手理由
      }
    }
  }
}

function 三角测量 {

}
